[
    {
        "title": "Successful Blood Drive",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1577",
        "text": "Special thanks to everyone who donated blood today at the Faulkner County Sheriff's Office \"Boots & Badges\" Blood Drive! We surpassed our goal of 20 donors! We had over 30 people sign-in, and the blood institute was able to successfully collect blood from 25 donors! You all helped to save lives today. Faulkner County Sheriff's Office and Arkansas Blood Institute appreciates each of you!"
    },
    {
        "title": "Missing/Runaway Juvenile",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1557",
        "text": "Faulkner County Sheriff's Office needs your assistance in locating Missing/Runaway Juvenile Jazzlyn Brown. She is believed to possibly be in the company of her mother, Cody McGlamery, who has active warrants for her arrest. If you have any information on Jazzlyn or Cody, please contact Faulkner County Sheriff's Office Dispatch (501-328-5906) immediately. Please reference Chief Deputy Chad Wooley and SRO Steve Ferguson (Inc # 21000563J)."
    },
    {
        "title": "Deputy Hensley Receives Hero of the Month Award  ",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=532",
        "text": "Please join us in congratulating Deputy Josh Hensley, recipient of the Hero of the Month Award at First Community Bank."
    },
    {
        "title": "Detention Center Unit 2 Escapee Apprehension",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1558",
        "text": "On July 4, 2021 at approximately 5:50pm, Faulkner County Sheriff's Deputies were notified of the escape of Dystiny Diamond from Faulkner County Detention Center Unit 2. Over time, Ms. Diamond had manipulated old chain link fencing welds in the exercise yard. She removed her clothing and was able to fit her small frame through the fence. Once out, she stole a nearby parked truck with trailer attached. She then forcibly rammed the vehicle through the gate to get onto the roadway. Deputies followed the vehicle toward Harkrider St., north on a local access road, and onto Robins St. The vehicle collided with electrical cables and came to rest. Ms. Diamond exited the vehicle and was captured on foot. Deputies secured medical assistance for Ms. Diamond for injuries sustained during the escape, and she was transported back to Unit 2. As a result of the escape, Ms. Diamond has accrued the following new charges: Second Degree Escape (Class B Felony), Theft of Motor Vehicle- Truck (Class B Felony), Theft of Motor Vehicle- Excavator (Class B Felony), Theft of Property- Trailer (Class C Felony), Criminal Mischief Second Degree for damage to the truck, trailer, and gate (Class D Felony), and Criminal Mischief Second Degree for damage to the power pole and meter (Class A Misdemeanor). The fencing at Faulkner County Detention Center is currently under repair."
    },
    {
        "title": "Level 2 Sex Offender Moving into Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=537",
        "text": null
    },
    {
        "title": "Blood Drive July 27",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1560",
        "text": "Faulkner County Sheriff's Office is hosting a blood drive on July 27 from 10:00am to 2:30pm. The blood mobile will be parked in the usual location in the parking lot of the Robinson & Center Church. This is a \"Boots and Badges\" themed drive, and to help boost attendance, participants will receive the themed T-shirt and a free entry to Magic Springs. While walk-ins are welcome, registration is highly encouraged. The flyer is attached, and you may register at the following link:"
    },
    {
        "title": "This Independence Day, NHTSA Reminds Drivers: Drive Sober Or Get Pulled Over",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=535",
        "text": null
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for June 2021",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=544",
        "text": null
    },
    {
        "title": "Commercial Burglary Arrests",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1561",
        "text": "On July 7, 2021, at 12:42pm, Faulkner County Sheriff's Deputies were dispatched to a Burglary call at the Sharon Freewill Baptist Church in Vilonia. Upon responding, Deputies noticed damage to the front doorway of the church. After a thorough investigation of camera footage and witness statements, Faulkner County Sheriff's Deputies have arrested John D. Beckman, Keith Flannigon, and one Juvenile Offender on charges of Commercial Burglary (Class C Felony). Faulkner County Sheriff's Office really appreciates the assistance and cooperation from the community. It was instrumental in the arrest of these three individuals on this case and possibly several other active cases under investigation in the area."
    },
    {
        "title": "Level 2 Sex Offender Released from ADC",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=543",
        "text": null
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for May 2021",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=531",
        "text": null
    },
    {
        "title": "Vehicle Pursuit Ends in Arrest of Subject Wanted in Colorado",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1565",
        "text": "On Wednesday, July 14, 2021, Faulkner County Sheriff's Deputies were patrolling Highway 286 when they observed a blue car enter the eastbound traffic lane traveling westbound. When deputies attempted to stop the vehicle, the driver, later identified as Jerimy Gadberry, did not slow down or stop. Mr. Gadberry continued westbound for several miles and used the oncoming traffic lane to pass several other vehicles. Several vehicles were forced to move over in an effort to avoid being struck by Mr. Gadberry.  Mr. Gadberry continued at speeds between 85-90mph. Once Mr. Gadberry approached Skunk Hollow Rd., he locked up his brakes in an attempt to get deputies to collide with him. He then increased speed at the intersection of Highway 286. He continued traveling at high speeds through three parking lots of local businesses with workers present, swerved to avoid a light pole, and continued southbound down Drillers Dr., jumping Highway 286 without slowing or checking for traffic.  Deputies caught back up with Mr. Gadberry at Caney Creek Rd and Amity Rd, where he blew through a stop sign and wrecked his vehicle while attempting to turn onto Betty Lane. Mr. Gadberry crawled over his passenger and attempted to exit the passenger side window. Deputies successfully took Mr. Gadberry into custody at this time, but he began banging his head on the window of the patrol vehicle. After being cleared by medical personnel, he was transported to Faulkner County Detention Center Unit 2. He remains housed with no bond on felony charges of Fleeing and Aggravated Assault, additional misdemeanor charges, and an Extradition Hold from Colorado."
    },
    {
        "title": "Level 2 Sex Offender Moving to Faulkner County from Michigan",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=538",
        "text": null
    },
    {
        "title": "Online Auction Item Viewing",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=545",
        "text": "We are getting started here at CID for the item viewing of the Faulkner County Sheriff's Office Online Auction of Seized/Surplus Property. We will be here until 2:00pm today. Please wear a mask due to the rise in COVID cases and limited spacing in the viewing area. You may be required to wait if we are at max capacity in the viewing area."
    },
    {
        "title": "Christopher Phillips Arrest",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1568",
        "text": "Christopher Phillips, who has been wanted on several felony warrants, has been taken into custody! On July 20, 2021, Information was obtained that Mr. Phillips was hiding in a local residence. Faulkner County Sheriff's Deputies, with the assistance of the U.S. Marshals, Arkansas State Police, and Conway Police Department, received permission to search the residence and located Mr. Phillips hiding in the attic. Deputies observed a black motorcycle at the residence, shown to be stolen out of North Little Rock. U.S. Marshals attempted to make contact with Mr. Phillips in the attic, identifying themselves and advising him to come down. When Mr. Phillips failed to respond, deputies and officers entered the attic. Mr. Phillips immediately began resisting arrest and fighting with the deputies and officers, and he unsuccessfully attempted to remove the taser from one of the officers. At that time, deputies were able to detain Mr. Phillips. Mr. Phillips is currently housed in the Faulkner County Detention Center on the following charges: Aggravated Residential Burglary (Class Y Felony), Possession of Firearms by Certain Persons (2 Counts Class D Felonies, 1 Count Class B Felony), Possession of a Defaced Firearm (Class D Felony), 3rd degree Domestic Battery (Class D Felony), 1st Degree Terroristic Threatening (Class D Felony), Fleeing- Vehicle or Conveyance (Class A Misdemeanor), Fleeing- On Foot (Class C Misdemeanor), Theft by Receiving (Class D Felony), Resisting Arrest (Class A Misdemeanor). He is also the subject of several additional ongoing investigations at this time."
    },
    {
        "title": "Neighborhood Watch Partnerships",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=550",
        "text": "As Betsy Hodges once said, \"True public safety requires a collaboration between law enforcement and the community.\" Faulkner County Sheriff's Office would love to partner with you to help make your neighborhoods safer. We all know that law enforcement cannot be everywhere during every minute of the day, and the community plays a vital role in neighborhood safety. You, the citizens of Faulkner County, are the eyes and ears of the community. You are vital assets in assisting law enforcement by identifying persons of interest via social media and news outlets. Because we recognize how important you are, we would like to collaborate with any neighborhood interested in starting a neighborhood watch program in their local community. If you are interested in helping make your community a safer place to live, we would like to meet with you and offer our assistance in helping build a neighborhood watch program. If this interests you, please contact Chief Deputy Chad Wooley at 501-450-4914 or via email at "
    },
    {
        "title": "Now Hiring Detention Officers & Patrol Deputies!",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=549",
        "text": "We are hiring! Join an incredible family-oriented team! If you are interested in applying for one of our available positions and working for the Faulkner County Sheriff's Office, you should download and complete the attached application. You will need Microsoft Office Word to download and complete this document. Once complete, you may email your application to "
    },
    {
        "title": "Online Auction Closing July 22",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1566",
        "text": "The Faulkner County Sheriff's Office Online Auction of Seized/Surplus Property begins closing for bids this Thursday, July 22, at 12:00pm. If you haven't started bidding on the property you are interested in, this is your last chance to do so!"
    },
    {
        "title": "Two Vehicles Retrieved from Flooded Areas ",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=511",
        "text": "Two Vehicles Retrieved from Grassy Lake Road Flooding (with Flooded Road Warning)"
    },
    {
        "title": "Sheriff's Office Public Online Auction",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=534",
        "text": "Faulkner County Sheriff's Office will be hosting an Online Auction of Seized/Surplus Property from July 1 at 12:00pm to July 22 at 12:00pm. Items are available at the following link:"
    },
    {
        "title": "County Office Delayed Opening",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=509",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Moving From Texas To Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=510",
        "text": null
    },
    {
        "title": "Multi-Department Search, After Foot Pursuit Leads To An Arrest",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1526",
        "text": "On March 3, 2021 at approximately 7:30am, Faulkner County Sheriff's Deputies assisted Arkansas State Police in a pursuit in our county. Arkansas State Police initially attempted to stop the suspect, Joey James Staley, for multiple traffic violations. Mr. Staley fled on foot near Sullivan Road after losing control of the vehicle during the pursuit. After an extensive search by Arkansas State Police, U.S. Marshals Service, Faulkner County Sheriff's Office, and Maumelle Police Department, Mr. Staley was taken into custody at approximately 7:30pm on Flag Pond Rd. This remains an ongoing Arkansas State Police Investigation, and any inquiries related to this case or the charges against Mr. Staley should be directed to the Arkansas State Police Public Affairs Office.  "
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for February 2021",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=515",
        "text": null
    },
    {
        "title": "Information In Case of Severe Weather",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=517",
        "text": "We have put together a flyer of information for you to utilize during severe weather. Please use this information to find local shelters and to access the Code Red Weather Alert System and the Smart911 System! Please keep yourself and your family safe during severe weather."
    },
    {
        "title": "Faulkner County Sheriff's Office Bike Safety",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=518",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Moving From Arizona to Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=516",
        "text": null
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for March 2021  ",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=522",
        "text": null
    },
    {
        "title": "Warrant Scam Alert-Be Cautious",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1533",
        "text": " "
    },
    {
        "title": "Level 3 Sex Offender Released from ADC",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=521",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Moving From Pulaski to Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=527",
        "text": null
    },
    {
        "title": "Arrest made in Stolen vehicle case out of Cleburne County",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1524",
        "text": "At 9:25am on March 1, 2021, FCSO Deputies were dispatched to a location on Pinnacle Springs Rd. to assist the Guy Police Department regarding a stolen vehicle out of Cleburne County. Upon arrival, deputies observed Cody Cardin exit the vehicle and begin running southbound. Deputies pursued Mr. Cardin through a field on foot and were able to detain him without further incident. Mr. Cardin was transported to Unit 2 where he was later released on Bond pending court appearance. Mr. Cardin is charged with Felony Theft by Receiving, Fleeing, and a Fictitious Vehicle License."
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for April 2021",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=526",
        "text": null
    },
    {
        "title": "Level 2 Sex Offender moving into Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=528",
        "text": null
    },
    {
        "title": "National Human Trafficking Awareness Day ",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=505",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Moved from Washington County to Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=525",
        "text": null
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for December 2020",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=506",
        "text": null
    },
    {
        "title": "Level 1 Sex Offender Moved from Cleburne County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=524",
        "text": null
    },
    {
        "title": "Faulkner County Sheriff's Office Statistics for January 2021",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=507",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Moving From Texas To Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=503",
        "text": null
    },
    {
        "title": "Level 1 Sex Offender Moved Into Faulkner County from Jefferson County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=520",
        "text": null
    },
    {
        "title": "Arkansas Sheriffs' Association Honorary Membership Program",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=552",
        "text": null
    },
    {
        "title": "FCSO Made an Arrest for Aggravated Assault on a Law Enforcement Officer",
        "image_link": "https://www.fcso.ar.gov/plugins/show_image.php?id=1520",
        "text": "On February 4, 2021, Faulkner County Sheriff's Office received a call regarding a disturbance and damage to property in which the suspect fled in a vehicle. Deputies located and initiated a traffic stop on the vehicle in the vicinity of Crooked Creek Rd. The driver, Juan Quiroz, who was initially traveling in the opposite direction of the deputies, angled his vehicle toward the deputies and attempted to strike their vehicles in a head on collision. After avoiding an initial collision with Mr. Quiroz, he turned his vehicle around and, again, attempted to strike the deputies with his vehicle. Mr. Quiroz then drove through a yard, almost collided with a parked vehicle, and exited on foot. Deputies were able to safely take Mr. Quiroz in custody, and he was transported to Faulkner County Detention Center Unit 2. He is currently being housed in Unit 1 without bond on multiple charges including Aggravated Assault on a Law Enforcement Officer, Fleeing, Criminal Mischief, Assault, and Failure to Appear. "
    },
    {
        "title": "Level 3 Sex Offenders Moving to Faulkner County from Pulaski County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=530",
        "text": null
    },
    {
        "title": "Level 3 Sex Offender Released from ADC to Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=504",
        "text": null
    },
    {
        "title": "Level 2 Sex Offender Moving To New Address Within Faulkner County",
        "image_link": "https://www.fcso.ar.gov/press_view.php?id=529",
        "text": null
    }
]